package category.greedy;
/**
 * --------------------------------------------------------------
 * <title> 백준 2798, 블랙잭 </title>
 * 유형 - 완전탐색
 * 복습 yes
 * --------------------------------------------------------------
 * <b> 주요 키포인트 </b>
 * 카드 중 3개씩 뽑는 모든 경우의 수는 조합 C(n,3) 이다.
 * n=100, n(n-1)(n-2)/3! 에 대해서도 충분히 제한 시간안에 계산 가능
 * -> 단순한 bruteforce 구현 가능
 * --------------------------------------------------------------
 * <b> 나의 풀이 </b>
 * - 카드 세장이라 for문 세번, 모든 경우에 대해 완전 탐색
 * --------------------------------------------------------------
 *
 * <b> 채점 </b>
 * <p> 메모리 14300KB / 128MB , 시간 132ms / 1000ms
 * --------------------------------------------------------------
 */
public class StackSequence_1874 {
}
